{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAPgAAAAAAAAA+AAAAAAAAAAAAAAAAAAAAPgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAPgAAAAAAAAA+AAAAAAAAAAAAAAAAAAAAPgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAPgAAAAAAAAA+AAAAAAAAAAAAAAAAAAAAPgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAPgAAAAAAAAA+AAAAAAAAAAAAAAAAAAAAPgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [8]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/l2_normalize/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAEAAAACAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/l2_normalize/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [1e-12]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dmodel_seq/conv2d/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "128"}]}, "tensorContent": "ksT1Pt1sHT9t+sQ+E9GlPvNrJT/cV7s+FXcQP2+vFD9vxgU/vIrSPon7Iz87yfY+zfEhP3gByT72YxM/ploaP+qbnz6FAzs+rxnUPtu8oz44kNY+yQspP5ck3j5rzSc/ipwZP52kDj8jfpo+yJGcPCQ9Dj/mtd0+FNMFP2oZ9D5i5Aa+oOP6PqsoIT9a1vw+8UsnP4L0nz55qxA/LmXtPixBHT9Xg7M+lL3nPgC7FrzE7ys/KLYlPyMvGD/8yOM+qiwfP/31mj7Riim+PhkIP+cWJz5jrAg/UAbaPvTNyD48y5U+yZn5PtSamz5qQio/0d4FP32I3D44evg+hN0gPwo6+j75L5Y+YruaPjr8+T4zHxU/VZ6cPuwqP73hwgM/kNLdPiJDCD9EzaM+if8KPzmqsj6Gw+Q+EiiVPi6goj4mLf4+cgINP+6T/T4yFBk/zSC4PqKEtz0+uBY/ztWaPkjqHT+4qNk+weG0Ps7DGz+cE6E+pBPpPqfN3z6PV/I+BI4kPwZO2T5uYgM/pQ+xPidK5j64+Ag/6n8JP8Jatz2DCQw/aS26PjTzsj5nxRo/GGf2Ppo7/j59/wU/98sYPyPIBT9PJNU+bAgBPy0f4z4hb0A+sdoDPxwTDz+PTPk+f3RHvoURCT8M/Lk+A9PCPtAbAT86dRg/93EXP7HwsT6no+8+n2zGPuJo/j4Bwq0++ODBPvulFj96GA8/sirIPuGg4z5tKpA+oAIkPxbXqz6JmhY/OhaWPg+6sD76ewE/W9v0Pqw5pr1zEwU/3ZuQPoSDtT5UqcU+3KLPPnYHqD6Tz88+ZRvBPr2nAz/XKTw+jWqoPsX41T5XUt0+xvQcPwBTLbr4ZpY+3anyPnoGpD6IEyY/YTwOP7Kj0T4vJu8+dkciP+SC5T739ys/7MXSvU621z5lrvI+AlOkPioqRT8TCQo/c8icPnkLo71CO8M+H4gGPsnD0z5Mvv0+ft0gP0pLIz+cpMA+/8kZP0nQGj+MyQQ/l+ruPuUAzj4tsP8+Wv8mP0zSHD9B4sA+G4/GPs0pLT+DqrE+VvL3PVPGxT6IsPk+UlsQP57osD4oYyU/BwKSPtDFsj6qDh4/fzjAPgPMnj496Bo/4pnaPsUpxD75OhQ/MkI7vruuDD9qvfk+CSnOPo9vrT5QZwQ/5/crP+K5ET+TLiM/lX/mPlgk/z77jLs+IPrQPjXdET+jxQM/3W3+PiQDIz9DzyM/otuIPdY18D6s19Y+igEZPwMzEz+Fx/U+4mC2PkQh7D6S2Co/jWX0Pi5NEj/iopo+HVwhP6R/A77C+x0/GkwcP0Ogoz6n2Bo+BCEBP97pij6r5ag+DsMOP0w09D6q6AY/7lbhPnK7oj7UE5g+fOrxPoghED94mAw/eabQPhLZ8j4GsPI+HMylPsOn8D6FEJQ+2EocP67V7D62u5w+/5n3PtRS/D61Jvs+E60Vvg6HDD+AjSA/EyUIPx1K/z6EJQQ/ULSSPhNclz5kWxo/itm0PmJe7b3i3hs/QPvfPjDxFD+VMLg+67E3vquX9j51DNQ+3E8VPylGFj9bX70+S9zOPjhkET9pOuU+UcMEP/DuvT4S6co98OwmPzmBxj6pPQs/9SsvP/8KsT7opiQ/75L8PSO4Ez8OUSe+pMGsPttYAz/brxQ/DIQgP2vX1D4SFfY+29CzPk5xzj5mwQ0/eoMKP+knoz6ve7o+e8btPl0o3j57Wag+WhaaPspOFT/agxy+rDi/PtugCD+Utdc+hhwUP9XMKT894QY/rLnsPh5B8z7x1cg+Hk8ZP/drDD+LtJw+usshP/yMlT5QgAu8+9j/PiKXFD+1xOg+6TrcPuF+Iz8PbMA+XacQPwxysz5Vsas+Y1ImP5xrGT8Ei8I+KZEFP15i6D6iO7U+AeDkPla0Jj+pbBs+H3oJPz4GDz/M/gM/hCn9Prf0FD+2RZE+FsesPqypoT5Yrao+AwmbPoIf7z4ZNZI+3X9EPp5f+z6PrMA+UAgiP9eCJT5h0/o+8Lf6PhMJ3j66A5Y+FxSePkSmuj466Qo/p/2ovrhWxr4/zg2/hpGSvvbnp76aLQe/Nycmv05bFL+O0oy+O1Gdvp8o074NlLy+uirJvpvpD79Js/2+fk3evlSEDL9g6iO8Rmqrvrizv77h5/a+KjjAvlYWE79ryBi/0b8dvzcrIL/09dS+rxgLPkR/H7+acee+OoUDvwyQjr4Af029AuAQv+VgGL9dhhO/R2T8vieb3L5HuA2/q0a3viYJG7/E6vS+CbkGv+BjHz3JHtK+94QXv2f3474NdxG/81Mov9CPF78wAsO9PVGavrh2sbwqQxS/BdUjv7Ytkb7QYie/i1ABv3eN4b4tPBy/iG3BvrXEr773x6C+fpXBvmz7Gb/8OfS+yNIbv93Go75b2QC/7Lokv+4GvT2AMRC/GF05vyW/zr4kvb2+IFT5vgRJ5L66dSa/ObWRvqarv77xFAK/DznKvg+EFr+UWJ++zLcKv/x+qr3pbQK/dNkVv23S5b5YNem+AsIMv6Egsr6N3ve+iX4Yv1q/yb671gW/nAskvxsWzL5Gfsq+CrwKvzC9Jr95cyi/8pepvhmyCj7lY4W+Ssgfv1oyD7+IEtu+vKwRvygjyb6NN/S+2vGzvroC677S//W+Uqbrvgj5jL5GmaE9RszsvvMrHr83Z8i+dB+KvYXNt74TgL6+UtChvrUOzr5+5hO/y3SsvvmkE7+p8tO+kZYDv+c/6r4GoNa+ACv/vlGXEL+JqbG+y+gKv6IFH7+ypoy+RkwTv2Bx/r4P5ZC+rpTJvtaXJ7/p2J6+T+AAv9gFyrweKw6/3q2Mvqibq75SVaa+agCZvpClIb82wA2/QEurvorypL4VREk++zQBv9FUw74mcgi/q1fkvq4jsj1LqCO/GyAjv1GNnb5Esa2+1z8Xv1Tzx75RNOS+LFnbvolXH7/mAgq/0MtGPJciwr7PGhW/T13pvr3IMr+aYCm/LOsBv60kzj08td++mo++vQaMk776jMm+Nj4Vv/utBr9LIP2+2s7Zvj2R7r7lVaa+U7ndvowME78NA9q+pJPmvlp4A78Rs66+KpvzvhRj7L4scaS+6A/DvC6Ww769NxW/w0kVvyy+8L6AE/C+q9gWv8nKjL4o5RG/+5zUvpS4Fr9+y92++YKdvt2pEr8Y5sS+4NIvvYTEG79LuNa+y2PKvpIfB7+V/ba+UYEZv6gZFr8x/Ai/2vCgvmARyb4f3Su/HuOtvjzYx74CNym/S+qkvs/4FL8XE8q+mOf6PBtUB7+9JgK/PS/DvqpYJr8bMxC/3AEAvxjTIL/2BAu/L6aUvrqjAr/ZKwG/5J67vqckJj6xeAO/jMGlvlvMCb9vnw6+HMIhv5NKuL5KkSq/MYjfvjEX4b7dYsK+HHS+vmc9Hb/yDta+fhHNvuFJCr9M1cG+h0YlvxooBL8o2qy+F0rcvloXDb8afxK/Qt61vgpoGb+5TRC/dTAnv3W3C7+wmgO/HPoqPZCODb8T9SW/3crLvm+lkr7KKv6+fgbPvpxcAb9HWL6+qtrtvu5jgb0s/qW+r8ckvyeSlL4rJQm/vwwpPv5v3r786c++k+fQvq1zhb5He8q+24QJvweuI7/Mieu+0t2Svko6xL7eCra9ML3AvgRujb59Z/G+3tYNv8CEGr86QBS/R2E1PnupFr9GEaA9jNOgvsItob4r75i+I7gPvwOY2L6EYSm/qx3hvlitGr/IqMW+wjorvzHquL66Cx+/Plsnv+FXFL9jtJK+LXYUv9Xuub4KLjG+6Lcmvx0QMr/ngA2/ms0Vv03KBL8y4de+pjWSvlQL9L4UJyC/LS0nvz1K474z8a+++xEDv/cLAr/8oze+tri6vgivy76ev7u+kD/7vkmSGL/Ac+6+ubHXviCz8L6NO9O+rcDQvhcr1L7ZrhC/N0UdvxvYD7+uUPe+PNW/vnn9Jr/Rdjw+dF4cvwodIb+hrPG+2rjuvtDnIL9uiRu/Him0vslL075bGAO/Wy0rv6JgHr/73yS/SAwOPcj4Eb/t9Nm+IYchv/+2Cz7kTRW/GcS0vnmyCb9SkQC/iBwXv4pwFL88EYi+iFABQHUkEEDTzfo/tEYIQHet+T+hgxNAp/wCQLR/AkAu8/0/LaUIQANi8z9yngBArJ0BQG+X+T8/1xBA01AOQBwaD0CIBYu8Wwj5P87HFUAxtwlANNYNQB8Q+j9QeQdAuWADQBIf9j/40gJAAwg0vpobBEBx9w1AfV0JQMgiAUBINkY94pH5P1obBkC2DglA3QMMQLXoB0CJgfg/P9wTQJXb+j8Qlfc/0d0SQFhUxDwxsRBAX7r/P8O3CkBKugJANQYDQG0fEkCwYZy91RkFQGa2vT3XoQRA3O/7P6ytAEDuKxBAavcIQE/cDECXtQFAz9gJQPExDkBsEPo/xPwEQO84C0B4YwlAmJYSQGGUE0BvuwZAXh8GQOA+ybvmXxFAQbwAQCYNDEApefw/bvjyP5E1AkBzuQNA4FcJQIUT+T+ICf4/C5X6P/e99z/2HPc/fXXxP6YaH76pCAlAgRALQLMzDEBIufM/zNL2P5FUBECgvgZAu2YKQIX19z8cov8/4X0AQCti8j9jRglAr48NQFUFEUBduA9AdP72P+iapbwpPhFAcdcOQCFdCUB/GRBAb10LQLnLCkAbOf0/5NEIQPdiAECHGPk//wr2P7HrCkBmAwG+Hxz+Pxb4D0AoHgtACF2tvYUH/z81OAlAYPcQQAZc/T84hAtAzXgAQDwDB0BL/CZAi5cpQCEHIUCePBVA2BInQMJ1I0A5eSNAkcEUQDHCE0A38SBAOpAXQN85JkCPYh5AX9YTQJuvEkC5/B9ALtolQLhEQr7m8yRAD/oqQNMCGEBx3yBAumoVQI4UIECWNiFAhBomQNSjJ0B0+mw9dCwSQFtuFEA2ViNA0a0kQK5Ys70JLg9AbJIkQD2yGUDX9RtAGtAdQGpNEUD6lxlArsMgQAYVJkDrix5AfKvfvTyBE0AwLB5Av9EdQPB6HUCjcCBAlJkdQPkRO77efyZAvy8FPr33HkCgNhRADPsWQKctGEBwSBxACxUbQH4uJUAEih9Am0AWQOlyF0CM3RJAJ4UjQEQqFUA16iVAP6YfQHJQEUAgFxZA+z9Avn7XD0DzDyVAf/MPQNuEJEDFeiBAYasoQIlaDkCjWA9AiEkhQJ01EkDsqidAJzYWQDMNFkBXBRdAby4+vpV+GEDUyxFARWMXQEqyDkAZOw5AfqYaQCnuDkCwDxhAHLohQLAQHkAKBRZAM1QjQNlJIkB39RtA8BcYQNcaI0CEiiZAvNMyvpNhJEBWURtAfGEWQG6CJkBzMw9AhlgcQI4QG0CLThtAQ14dQIZzIUCkEidASLcbQP/sAj7AeiZAic4gQGs3JUBe8q89h8EmQOSOEkDoeCpABEkhQHSPI0DrkSNAYYwZQFneJEDy5iZA0lglQMoRI0AU7yFAkHMUQOPWH0A1tCVAIhMWQIBAEUCypCVAnLscQAskD0C/rBRAq+YiQL17EkARSShAvlDaPb3fIUDz4SZAEQEUQCmwFkCKpRVAQEsdQAgfF0BEfRdAwAQeQLTsBL5ddxlAZD0lQNKHHUAFLRtAfHsDvhKSE0D+xyFAaGgWQOpvHEAEpShALKEkQJ9nG0DduA9A4BQkQPaiEEBAZye8n7gTQPDzJUAvuxdA2IApQK/kFkBmeQ9A/viGPfiOI0CY9ry9vJklQHhGEkDN0hNALnYTQPuzGED5mRdAL7AbQN5EEkDfeRZAlhEiQJKrEECw6yRAZ+kRQDkNJ0CVxyNAd5UVQMKxGkCFh0e+PYkPQBXMIEC/mhtAPW4WQBYNIUCe0CBAe30hQEz9JkDwLCNA91EdQGMqFkCbPB5AfLsWQOf2EkBzxSA+6EIlQGO0D0BICB1A49ElQNZuEEARkCVA+eQRQMYaJ0B+MCJAtvAQQDNSIUAVnh9AZnAbQEz+H0BQsRNAeekWQL7gJkCgM8K7ZiQWQLzqJkCQVSVAt3MmQKlBH0B8kQ5AjlAjQM3iJkAniB9A7iUWQPR8GkDm8BZA1Js0vWCkGUA1wBxAWvMdQCqjL7502hZAlnojQAtUH0DczSFAYrwfQJ+BGkDGHR1ALdcAQNj3DkD5vfQ/vvcFQE4K+j+Uaf4/3uoKQHrMC0Ddqv0/IXsPQJcAEEDZW/s/D9QNQOgnC0CQfg5Anw8AQHTbEUALsSS+L5f+P5swBUCvtABAL3oAQKJrD0CxpfQ/6qMTQPuCBEBu1w5ASuntPXgNAkC+A/o/E0b1PypcCECnb5i9iRYOQLRZ9j9TTPY/rHv9PzjjAEAuw/o/HncJQGex/z9RzQFAKMX5P018Eb4DuxBAJmr8P2qRB0DjxxBA7XQKQIjIBkCIaAU+UW0EQBQHk71olgZAo+n5P9J6EUDhzvg/lyILQN+j+j9ing1AugIEQPypAEBUugVAYNwKQEBpCkB09wtAkfQBQMH/DUDqw/U/sGAOQCeb7b0eCgpA50YTQPkjAkBBS/0/rvDyPyzCFkCwBRFAaTkLQMzDDkDNzghAH3oEQLsFAkDlnApA6iUOQIrzML4+vgtAlMkDQA5aDUCs3gtA3fcFQIBeCkApRxBAG2rzPxkB9D+cnwtAf1/2PypiC0CntwtAvq0MQBiHA0CpIwpArRjzP2REVz1evgBAWZwSQEJqCUBPmPk/QyMNQHXu+z89Cfw/bLEMQPy2CEB2IP8/rBgBQLxD/z9GvtI9Xl8KQIUJAEBi6RFAns+UPVftEED85wdAg98TQB7iCkCgm/g/NQQRQLhzDUCIPyFAXKkcQFMzE0DZEw5A8ccOQEFXHEBFpyNA0N8VQFL6EEChHyJAhbgQQPSaG0AuoCNAknEWQOTXJkBXkiNAdJ0aQCbNnD39WxtAhAYaQMpzHECGbSZAtQMbQDTmEEDeRh5ALuEaQFWpEkBMezG9FvsaQHfOJkBxbB9AZZMmQN5z4j0kAQ9AiCQmQP1DEUD9gyFAnIwQQMYUI0ChaitAMc0PQNZOGUBA4hlAfQzGvfHZF0AvvBVARhYeQIYLGUCtsRZAhicVQEGTBb6uSBFABl8Cvq3cH0DykSNAghsVQP78J0DY+xFAh+EeQK3qG0Cm+xpACsEQQCOxFUC5BhRABCIgQFpYJUD69xZAPxMnQNu3FUCAXCZAmWYDvsReFkBHeR9A1xccQIArJUAnMyVA57EjQHqXEUAdriRA64ghQIl0FkCp+BVA+BYgQNlfEEAoXSZALgbfvaRTJEA+0RhAQBgoQJWoFECrjBxAOTolQPAEF0B/khJAETscQKnUFUAoZh5AxAkaQJKAH0DP4R1A4asPQENbHkBJFiBAIEnKu18DEkALqxxAdJUgQL98HEAWFx1AuX4lQGm/EkAwWhNAqSYYQOn+HED/LhNA/K8WQCkbM77NLRtAnwMXQGPeEEBk3zG9+UYSQPdhGkCBTBxAp9McQOzRD0B8XBlAwscdQOfFE0BLeiFAoLQZQO0zFUCGgBhAV0AhQDyGE0D0OiNAr0AjQF+6JED5cx5A1WggQDSuFkBYkSBAQpskQCNFH0Dx5B5AKLXpvGJiJ0D63SRAf94iQCFcI0DTVihA4o0ZQDlIHEBcFh1A+80cQELI570zah5AV8klQDOcHUAOJhNAmz02Pi2tIEArBxZA2msfQFwGJUDARyFA+xkUQJKtKkDEKyZAj44fQOn/EEAqnB2+0+EPQFcpHkAaIQ9A8dEkQLRUEkAg+xNA/6gFvn73IEAAuTo8CpAPQL3jGECfZB9AxMIYQDbDH0Bc/yNAFoEjQHEzJ0C59yZAE8UeQOGIGUDCQRpAba8kQH8eFkAsKRZAqTAlQNEXIUBGB8e9ArMaQJ49FUB5URhAVlsYQEltGUC2GiZAM6QRQP6UI0B3wxdA87IRQFJzHkAh1hRAyRgXQPgNFUCAVTS+q1UWQJhSH0BoRyRAz30YQI6SEkDtvhZAutIWQLfSI0DpFhtAJoYYQNTKI0CsSh5AfZscQKczJECSvR1AH1MhQMbXJkBAF8O8rbkkQKIVFkDzHBdAN1wmQKfFD0DGih9A/gwiQCNMEUAc0RNAccgSQO9nHkCB0xlASIE3vsW9IECuXRRA79MYQIKqKr4HjBpAUCkUQJ+UKUBJZCJAF5ggQDC2GECDcSJA99QQQPnfF0C7dBdANSwVQLyTFkDlUBpAQysOQExwHUCWYxhAyNMZQI02HkA+7Q9AuFEUQPejFkBIzQ9At+sHQAXbHEBYxu+8PkoUQDePC0BDnAdAHM8XQNx8D0CcDAhAvpoVQDiwGkA5qg5A4I+gPJ+fEkCrJglAoOkVQL6fCEBgjXy873oZQN3wFUDMQR9A1A8MQDFaH0A75BNA4VIfQHViG0ATGApA9gkfQMAz47159QtAbjcVQB2RDUD5gBNACIwfQOJNDUAyD3G96cMaQGiC2ry/cw9AkCUYQC9QGkAywxVAAlQYQC7iDEC1gAtAzkgfQLdODkDaEg9Aah4NQJ/nGUD97glAcDUhQMM4G0DAfBdALE0MQNTWdz3gyAhADX8YQBHBD0DWlgdA3WIfQCE2H0A/xglAR0cIQBUDFUBBmhxABjsaQMFkHEAdkBpAEUUcQAvjxL1ifBtAxtgbQGCrD0Bf9RBAo38VQL0xFkDwRQpAki4SQPiLEkA55hhAg48YQAo+D0CSDiFAEZARQJtBHUBHighAJLMWQKAGW72m0wtATqweQGPtEkBqzAxA324eQO0AH0Cu3QxADDMPQN/3C0DDyRlA97QNQFA4DED8mkO+e44NQMmsGkCkKhxAgKQGu9VPHEA9PAtAb3YUQBvrGkDWUxlASrQfQJeRDUCE+ilAaSQyQLplLECdFixA5C4bQH9QGUAEhS9AGV0YQKAxHkCaTBpAXZkiQPxvJkCi2RlAjwMcQK8EIkCvMSJAwmAkQNqj/j1XVyRA4nEpQMJqHUAkFhpAykonQLHkJkAlITNA9l4nQIRuIUDZjgw+7pUtQHrZIEBEsy1Agz8tQPzVeT2ZnylAPcsyQMz2IECcCSxA/P4gQKwqKEDr4DBA/M4fQJfVIUBBnCRAIgy2PV2dLUCMFC5AOZEwQNFdJ0Dszi9AgbwbQHhIrrw24CRAsOGevb2rH0AbcB9Aa8guQFPrI0AMSiJAKicgQItJKEC58R1AjgcvQIETKUDrrSdACrobQERwJEDmQi9Anc0rQBlFLEBO3hpAONvUPCv7HEA7MidAnlIiQPiLIUCjnx9ANFoyQE8sJUBJfyFA4V4ZQClzHUBC1C9AqukrQNdQGEAHnx5AsCk6PcpXJkDFHyVACQUvQOv/GEBJbylAtDEqQIkgLUDECS9Aw+MqQPegIkDIMTFA9igwQExJK0BbhSBAvisoQG7XGEDWyClAKP3QvcxLHkCYSCdA63opQOmpGEAwYyJAmyQrQP8xMUA4oClA2JshQKhtLEBZuRlA3xAhQEC9PbsbXR9AOiMeQBq7HUBvGMa9mcwoQHy5G0D8zitA/VAfQEnmH0CBvCxArVgqQM6lGkAJti9A0h8pQLHVGkD/HSFAxuEiQNQfKUDrAxtAcW0rQHJdG0BvsyhAleodQDSCJUDJKh1AAd0YQCTcH0D2axtAebg5PjGWK0CJQi5A3+YgQH2YHUCL8yJAJBgsQEXEGkCXKR9AQ1QhQF6ZuT3qViNAbVYwQNHMLEC75ipAxBkhvpreIUBY3TBA7pwiQN/UIEDI3xpAMnAoQDINIUD7kShAD88rQEPiMUC6g6I9gSYnQFD0JEA4gCdA3RI1QHanJED1GRlA12b3PWJlKkBASqM89ooaQIpgLUCo2yVAlsUfQKPvKUBi2S9AM+UlQOFxLEDcpSJA5wwZQH0pJ0B2ZR5A6Q8aQOqfJEBNfyBAthcqQGIxK0CmAS2+7o8bQN7eJEBgwSZA2q0cQC7xG0AcWC9ANnAYQJMeLkBV3xdAQ8sqQN4yKUCTPRlAe8sqQEl1MEDCOO89c4UpQIaDIUD9kB9AW3ArQOa5JUC82xtA70EnQE1SG0BTxytANd4jQKyxG0B+jBlAeiUdQAc5GUA41StAu2skQOUsGUBa6RO+lEIjQACTJ0Bgjy5Ay8sZQEqLLEAh5i9AuC4rQKL7HUBJJS1AGFMbQK/JKkCR3CVAsOiyvPVtJ0CVmyRAReorQAzKHT14VxlAhXAtQBQqLUB3Nx9AYaIcQEIsGUDzmBtAWWYPQGxNGUAUwgdA39gWQLeAFEDweQdAsJsNQF8fF0Bu2wRAXSMBQDrlBkAsfghAnaUIQK7SF0DGoBhA4h0QQMkoGUB0M3m9AMURQGWhGkCrGQpAogEOQP4eE0B1uxVAT4QSQI1TGUBFShhARc5DPvZIGkC8IwxA3n4YQDNdE0BKR4A94rgEQIzxGEBxGgxAb2MJQDn8BkDGIBhAFFoSQAXmE0AcuAxAb+oRQA7Hq733AAVA2+YTQHgWE0BcmxZAdWARQHqzEEDEORm+bFwLQB+lSb6rsRBA/h8ZQJxwF0Cq7BNAmZASQDZ+EUBJ9glAXz8ZQLV0CUDwkAdA+YQXQOcvD0BE7wFAregSQGjHA0Cs4xlAtHEPQHB9gjx/OA1AOgEfQIfcFUCrDxNAAfMLQOgrH0C3jxdAg3sRQKY5CEBdhhZA838GQNqFGkCe8glA5SYLQDTmPb54ZxFAf7ARQFh+C0DaEw9AZrcVQEInB0DeXgpALiQaQGrJBkB/CRNAZykFQKevF0CxKhtA6OYOQG2XDUDpigJAfNYIQDiSHL7atRRArcsIQNi3EEDTExFAjGESQGM6DUA7WQdAnwYLQO8qD0CORARAitoSQNWxEkAcIAG9h00IQGP/FkB3twpAJwkTvq2KGkABpgJAvQceQCnZF0DV6wRA+x0RQPm2GkAhMBhAN8osQOs4HkD4UxNAM0gmQHm/FkAK6CpAnJMXQDUAHUD63SlA4bEnQLQhG0BjGx5ApaUdQArdFUCluhtA4M0qQCUTCb7dwBRACAUdQExULEANtSFAm2EqQKGUIkBYciRAUvIqQN50KkD5Hku+vPQkQCrDHkD/RyhA+fIXQFzD173ktiNA3/IlQDvaFEDnHSFAmoEbQDQVJ0BKJy5A/OYqQOJEJ0CnPiBA6h6ZvRBcHkBBCCZAZIgcQEDhHUBpsS1A8fgkQHXH8L3vsSBA4HrVPN23IkDKjRZAYXcrQPu2H0BuDShA1wkmQEdCJECtIRxADQcgQNHQF0A2ZytAxFUpQKVCG0DsHRxAcK0sQGuzH0CM3hVAHBFevWBbI0CqGTBAPMIkQLC+FUCAFCVAIrckQKP0FkDz5SZAp6kmQNlgKUAEnRlACUwnQPYeHUArpBJAQzs2PjLgIkCoyxhAiUkkQM2kJ0DuPSlA9JgiQLQ/KUC+ghxA1iEcQDEzJUB8AxxAx4EpQDh2GEDnlBVAQskfQMCwKUCiRCtAGl/DPX1QHkCQuSpA5HAaQPpcGECPvh9AkhQgQJt1J0CudyZAEnQpQBHVKkAywyFAHpcoQACa6Dtl3iFAXhYqQCccG0A0Di++TNkrQMwjFkARYSFAZFciQLd5HkCQBiVAwVQeQAslIUD8tiNA+LYaQHT6I0ATPRpAti8eQIULFUDOnyJAakghQEGBHUDeQixA2lYjQIlaIkDFiR1AwvwiQLL9JUBAMRdAQviJvUPuH0AI4idAkmEeQH52HEDAKR9ArqUqQImRJECpQiRAl+IhQNTlaT0V6RVACMUaQEytIkCvoBJAqGOuPMtKK0BJniVA8rIbQHWJFUB0RSRAB9MXQDAWJ0AJjh1ALiopQCsaFUBwDIC9VqAsQJHAKkBhoipA3NkcQMkyKkBOeyhA0SlWve7TJUByNZc9PCYfQAuSJEBHayVALCUgQGlcHkAveiNAOE4iQATuF0C/rRdAzUUoQIBqKkBgkSJAvikhQEcUKkBCPSVABXkdQMBwF0C44jC9ii4bQLgaMkC0uiNAjvAXQDPDHEC4Si5AEesXQHpVIEA57SlAwA4kQGBfGUCjIR1AHtEVQN9hFEAUvTq+0eAeQNFWF0D8jyVAstIfQPVQLEACWhZArRArQOYGKEAVzSZAGgciQJDvG0AFfSBAEgYuQEJJFUCYkyJAuSEmQECIJUDQVtQ8VUoWQH85LEC2MydAo+ApQM6PGEDN5BNAmWAlQFFCF0AuAShA7S0pQG4pJUAXSCBAss4CviBJG0CxGiBAFRIjQEAxUDzz/ypAfs4kQJ5ZLUBflipAEQsrQHW5GkBDKCVAO3cRQODWFEChHQpAk8EYQEgcC0Dh3xRAbrYRQNspC0Acmg1AGroXQGyeD0Agzw5AFl4WQLelD0BukQRAS6sRQEPiCUCAM6E8Jd4QQJn2GEDYAAVAVtsDQHfFF0DfCxRA8RIcQN9rBkCqMwtAaC4pvgYeB0D+HRdAgPoTQGUkBkAIzcW8fvkWQOyDEUAjpRlAr3ANQK9aDkCLegRAI7EVQIbKGUB0iBdATgcFQFh5RL08swdADc8SQEauB0CzOyBA0+IOQKGwFECBTD6+uFcUQAyiFL6VmhRAAQYPQOHjDEAAJwRAX64DQMVpEEDGxRZAbNYaQPAlBkB/kBRAfW0XQGf0EUD/GhJAuNwHQOdTDEBxABFAxSUEQJNQFz6elRNA2kAUQKFsBkC+ow5ARjgNQIigFkBWhBFAYvgYQPonC0DugRdAVPUNQEueB0DiuxZAKeATQGThoL3eQxtAtzYZQN2iCUBbYRhA+1AJQKEKBkCIcQVAPdEWQI82FUBDTQRA6h8QQOVCGUCGCRRAFJ4VQKYlBkA1JBVAqY8EQJDN8r3oSRhA1I0ZQNcZFECz6wxAwckPQO9vFkBvkRBAnqgTQImgCED45BNAaiIPQN6RF0DanA6+3dYSQBPkBEDY+QZA3Xchvt34DkC9FhlADUYRQML5GEBfIA9AUMURQDtmGUAhORxA7rMhQOrCFEDXMiFAH6YoQPHkJ0Cv8hpAkIMcQNkdIkABvxVAJcgbQAVGK0B2FSRABvklQAfRFUDnJy1A+MwpQEl95b2u+BpAUzclQM1qHkCV+CJAo38mQBIKGkBKJyZAvLYrQA/fKkCdX/a9qGwlQH+vJUAP1ihAw7UmQIoh8D09txZAGGAWQA7cKkAdrCFAPqUcQFOqHkBbsS5AZfAZQAfWIEBvIidACHwUPV87HEBfISVA0gknQFvsHEC8LhhA/44pQJpD/r2tbRNAbKUIvoXcFUBI0RtAM9ITQKNWKUBtNSZAA8QYQM2jF0Cy0iJAvlQsQENcI0AYERhAMD0YQK5JFEDUPBVA4eElQKBpGUCN9SJABBQXPdLeKkCVVSBA9mYeQBKcKUCTXihAsfApQIA6I0B9oBZAD0MZQFn7HEDfHSdAOeAnQFbyK0BfRRpAgjokvqKNJ0AXIBtAls8nQDcgJkBWLiBAOEQlQAMgG0AmaShAI6cUQHQqJUARliZAYDQmQNeJK0Ce+xtAhaQfQOlGGkD3bipAsmyCvUnyHUCgSBhAbhoeQF4zJUDa2iFAeSUaQE3LH0Dg0BdAgC4gQFyMI0BKuytA4josQMyeHb5vHhZAotAUQDpgE0CEXSG+6+UVQNFqJ0DUviBAgLgTQLclIkDItCBAN5EfQAfbI0A8ni9Ax+IoQNprIEAewhlA7AwfQLzxJEC0tBdA8fwhQKP2E0AkpSpAPVAZQAzZHUC1cxpApBMcQDBFG0B0/B9A+NQdve0ZJUDenCBARLYpQKR1GkBW9xdAv2cqQDz6JUC/lihAQhkcQF7koT15pSdAlBMWQGOSJ0BwtR9A2oH+vTuLH0AUUS1ARx4TQLOQJUCwTBlAU+UjQKWGIEDF5yFAL8cpQHUvKECe5Oq9ITsVQENcJkC9zxdA+ZMuQIoaIUCGyydAf/3ZO+RaHUDl6jS+b0IkQJYhK0CsHR9Ag6UhQIV5F0BaPSJAbZcXQAIDGUC8xChAg5IuQEREJUDLOihADVEqQGT/KUDRdCBAFlAtQG8yLEDDQg8+iN8hQDZ8HEBKjSBAPRYoQOluJUDKsCxAsFogQCNDGkCZVRtAqAkiQHlTGUCaNCtAlR0XQIbsGkAK0/09WHspQG6PIUDn7xVAoPYWQEY6IkCk0xZA7I4sQNZZGUAi2ChA/eEaQJHeGUDYuyZAqeIiQJzhHEBLwitArBwkQMU+IUDgRLE8H6EjQJ1EIkBY+RJAa/oiQC9AHEALFhpAUUolQMVuKUDQEhNAUDonQG0HKkAwcRxA/yATPgulHkCz5htAfW0bQH6Ksz1MzRlA+RAaQLIBIUAJ9yBAyKwcQB8zE0DAcCtAfXcZQKLvDUCr7xhAELINQCDZFUAc6glA8S8NQFf9GEAVvhtAWWwSQLn3EkBoLwhApo4eQOJMFEBVxRJAA6AgQFvyGEAgm9C76HcaQPv1IECmJRBAw20LQK4eFECGPR1AvpsdQA7NFEBythBAaF0FvlVOE0Bp2g9Ab3cYQObxG0CA94m8O9oWQJUzGkACOxlAMBYcQKMaFkCrASBA1BEeQLeLEkB89QpAjcQQQMg95L0rlRxA0EohQKO4HkCSGRVAEz8JQLSBDkBa2VM8XJ0SQO89sb3ahhxAsuEQQMIzCUBjZgpAxEUQQCFdCkBFuxFAc4ASQPB1EUC8EAxAySkPQKF6CEADIR5AlDIZQAIdG0C0SRBAqGoOQKb+Qr4BXxVALdERQA+RH0BQ2B5AogURQC7bIECMyxRAXF8LQHFLGkCKLAlA4yUSQIK6DUBKLhtAW6kUQCxTVj0mWBpAQYELQNO2EkB2ThlAOdgLQKB9G0AF5hhAg+gHQCqhC0D4PxpAoVEcQJFQDkBywRBAu0YSQMH3EkAbUg9ALPIeQI7/273KTBlAJc0YQLOrC0CBJQ5AmI8MQBXRCkBZiwtAe04JQNYEG0D9Kw1AErwKQH5mFEC547q9hjsJQHsoEUBn6BlA4Ik0vD02CEAW5RpAAksgQLsfC0Aj+B5AnJQeQBxjHEDmURxA6Pc1QH2yKEA/2SlAJ7wxQJEOJkBtKSdAwxwhQLYpMUBZ+xxA6O4qQKPfL0BCLzJAJW8xQIe2H0A1eyJArLsjQKTtPL6LkR1AyvM1QA43K0DNejFADRomQCejHkANpSlA5SgzQEwGJECgNeI8BmsmQA1RHEAFqzBAgw8uQDFGu739uSRAeRMxQE/rJkCmgSdA8Q0cQP3GKkDnITBAelkmQARvIUB9RSpA4uqaPTo/MEC10BtAHxciQOVPKkCS1ilA6+ooQGHYFjyjZTJAEpIzvogyIkABEC9A8YojQLP1LEAGPzBAS0EjQAPKGkBjbBtAFM4tQFnQK0C9sxtA7XsdQOkLKEC+JTFACDYsQNa0J0BpgDFAkEGVvf91LEC3fjJA3AMfQKMzKkD0fDJAYGkmQOOdIkCB4xlAtRAjQHtWHkBvhyBA3IEaQLv7KkDfeC9Ad6YjvoBVH0BYOy1AQqQtQInmJkBNqCxAP3kyQJMbKkCBIxtAey0iQFuRG0B9ODBApogoQOeIKED22ydAQIgvQBq0JEAGLCFAuLEQvVHqHUC0pitAgL8YQAlGIkCEvitASoQeQMmWJUBbcS9ABf8vQCfCKEC7EhxATu0fQGaqAr5VxTBA5PgnQLH9HEDlIQE+5WMvQMEuJ0BUejZAlqEpQHUGIUBzgB1A0d4nQLSIL0A29iRATzgwQE0jKUDr8ipAVlMcQJ3PHEDf8htAkNYuQJr9L0AlZyhAN5AhQPDhHEDENCpAcWgqQGPlGUDWtyhACu61PYjrHEDCiTVA2k4vQJcoL0A4KidATeMqQKwBH0CR+DFAQOsmQMiIST1EpCNAwwYyQAjRIUAauyRAO+agvX5CMECMQDJAZ5QrQPMYIUBvdxxAbYMdQM32MECiCBxAiBAcQIcsIkCI3L+8SDQmQCMUIEASJx5AmC0oQHMlIkCQSRtA58w2vkLnJEDgkCO9GxMvQOI5LEDQmitADzEsQP7RK0DuAzJAjZMsQJnzKUATlR5A2wYiQPYYIUAVESJAl58pQPoaJkCxwDJA1+swQPIVJUDCkxO+cLodQJVKHEB58yJA/8stQP5eJEC0mihArFwbQNAwKkD5ZClABUQiQNC3LkAN6i1AzJcrQGNNLkBkdly9+5wyQJlMLUAj8DJAJagiQGwRK0DDZiBA7bkhQBPxIkCntiRALaAsQD0XJkBehx9A7B4mQNaSGUDPiCBAws0oQFprG0CixM49X4YsQPRGHECFhhxAwzclQChWMUCfwh1A4pEuQE9GHkD+cSFAHAUdQKqmJ0BiaxxAgGVgu4/bIEBhtSBA6+kiQGCDjrytxSdAaLcvQIugJkAsvCNAY0UvQO8cGkBT1RpA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dmodel_seq/conv2d/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "ILUpQKrTLUC/KylAIiEpQP9cKUDvtipA/NYpQEYjKUAOIClAPwwpQM23KUDilSlAbnIpQB5fKkBHbilAr2kqQJv8K0AAAAAA27spQN3dLUCdMCpA93wqQAH8KkA+UylAmtYrQL5hKkA0jylAAAAAAGX8KECaJClAwWErQOblKEAAAAAAaucoQA25K0Bs+ChArRIpQJz/KkBxBSlAv20uQCIPKUAcpSlAPCoqQAAAAAACtSpA5jAqQBxBKUD9sS9A3oIrQD5nKUBt7zu9JLMpQAAAAADXRilA29ooQOxlKUBPTCpARcEqQKnRKUBeYSpA6FAqQPVDKkD5PCtA5H0qQGWlKUBSBylAfkArQB3wK0D53SpA8MspQAAAAABfSipAJvAuQDIDKUAmaSlAlY4pQAN4L0CiWilAwksqQDHwKECiFylAIp0pQI8IKkBWQilAj7QoQAAAAACYJixAMQgpQG9FKkBU6ShA3VYpQPajKkB4pilAK1IpQLopKUAPYClAyYEqQGLPKUCX4itALdMpQLhmKUCygylAdWQpQAAAAACPhilA5PkrQBdCKUAzLypAjc8pQF7wKEALXilAlcYqQFvdKECdjipAQFwqQMbOKUAAAAAADMAqQN1OKUAjMSlAAAAAAHrGKUDm4yhA5XguQBoIKkBULSlA8cQpQG4CK0A="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dmodel_seq/conv2d_1/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "8"}]}, "tensorContent": "rr7TujnzDTtIwilAU8IpQF+dkz+PeYk/8XKJP4UNlj+NwIG8RFJzPDybJ0BZmydAsNCTP4s4fD/Pk4I/mrWUP6eFgTvL/1W7LUwqQBNMKkCeD5Y/TmaPP/Nwjj8Uopg/yHeNu+Qcmjt+EypAihMqQOa0kz97I4c/IRKIPxixlT802fY6lICNuvI9KkDkPSpAb/GVP9Y+jj9qqI0/EHmYP+mNizwQ2Zm8rH8pQHF/KUD9V5o/qFCbPzWUmD9825w/8IZxu/djejsZdSlAHnUpQCBbkj8F8YY/P0WHP+u8lD9+j5G7VgOSOwG1KUAqtSlA+nGSPz+Jhj/4IIc/S5aUP/xkbTtBgje7eXUqQE11KkBqvZY/rfaPP/Ybjz86Spk/dyiTuymonjtMGipAUxoqQMemkz8GA4c/tuyHP3DAlT/h79u7cj/bOz+MKUBfjClAScmSP0FthD9m6YU/3qeUPze9DTyfaAO8zugpQLLoKUAK75U/WpWRP0j5jz+lh5g/Ts7Ku6yuyjvWrylA8a8pQFbokj8XUYU/spKGP+rKlD+5dQM8id/3u9oqKUDGKilAYO2VP0d2kT94AZA/rnOYP6Dw6rsb9+M7xowpQOWMKUB9AZI/PtaDP18shT82EZQ/y9e/OtXQNbrtOilA3zopQLLSlD/x4Iw/8neMP5lYlz8ihU284NhEPEWKKEBaiihAVUKTP9vUgD9CBYQ/44iUPwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA9F6dOkbWl7lo7ClAWOwpQMWMlT+KVY0/qvKMP94TmD+X/3W8JypsPFvXJ0By1ydAz6uUP9vJfz+FLoQ/foeVP8x5NjxoVjC8+VYpQNxWKUDbBJY/m8aSP8LmkD9TnJg/5HHeO8PSybv3CSlA4AkpQGAglT9LuY8/RoGOP3y7lz8UFog7DeNgu9qtKEDJrShAf/qUP+RPjj/HkY0//3aXP1YxvruOGb47tMApQMTAKUClvpI/oDCFP89ahj+7upQ/jllKvAO7PzxpiChAgogoQID4kj90BYE/QQeEPzo+lD8bDwC8Mfr/Oy1YKUBLWClAEy2TP+fWgz8+vIU/MOaUP4Dxx7vmcNE7jNopQKvaKUBBZJM/vySFP2Sbhj+ZXpU/AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAlwIi77YmMO3D+KUB+/ilAX/iSP6LMhj+1cYc/GyaVP1Eoobs1eag77+4pQAzvKUCU55I/NKqFP4arhj8QG5U/fdYlvFgeIzz16yhAD+woQExpkz8pfII/fBCFPz7hlD/3oWW7bMB+O2skKkB5JCpA2IuTPwBIhz+z/4c/v72VP4ZujjFqNgyxrnOEODtvhDhH0pcxRYusMmy7sjJ9k/sx4F99uwimgztkBSpAcgUqQH1Ckz8UWIc/sPiHP4NTlT9xjjK8pessPBWpKEA3qShAdT+TP13XgT8Im4Q/LKOUP2Uqg7tMmIg78AAqQPcAKkC2cZM/V5GHP6w/iD+ha5U/LROfuyeWoTt44ylAlOMpQJO/kj/57IU/dceGP8PwlD/2fLk8DFXlvCpPKkDQTipA2uegPzlspD+yYqE/9m+jP3s2BbsxkBk7CS8qQBkvKkDu0pM/n1qJPwRviT8zIZY/KFmHvJ6HfTyoUidAwVInQBxDlD995Hw/riWDP3frlD+n2Ju72T2bO1vVKUBC1SlA3o+SPzgrhj9Y6IY/eqGUP4kQjDp+lrC59OApQPrgKUDfRJQ/A5CLPzMsiz8L15Y/PRwjO8vY57oNZSlAA2UpQOxZlT/jAo4/8GeNP7zalz8AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFTqmzwZL7W8EdcpQMjWKUBIQZ0/gTSfP0tWnD8a058/JMwBvIdW/zvlWilAB1spQCXbkj8xy4M/aJeFP5SRlD9oGbe7vm65O3fVKUCV1SlAtguTP7zEhT8o4YY/EAaVP1CuR7s3mwC85DgvQGQ4L0DNIrM/F+u5P63vtz+HW7Q/7aOxPDi/9LwFmSpAwZgqQDOtpD8Kuag/VtWlPxQHpz9eC4+7+YqVO+rRKUDU0SlAI7WSPxGwhj8SRYc/MvmUP5VvRjtjAI+6xXZHvdd2R70zeJW6v5yquvPYpbo4uJO6ytbMu5B/0jtLsilAYbIpQDRWkz/gOoU/Ra+GP3IzlT8AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFGtuLuDqbw7CeQpQCPkKUDaRpM/SfWFP5Mbhz9zP5U/T6Fau0B3azsGICpADyAqQHdukz+/mYc/USyIP/WOlT8i3bK7/CO7O9LhKUDh4SlAW2GTP3vkhT9tHYc/uFCVP2sYizujuGm7qC8pQJ0vKUDpiJQ/RPeNP3YMjT/OGZc/lH6DO/D7VruW0yhAddMoQOLulD9pG44/512NPwl6lz9la5y6HhfeOh6IKUAmiClAbhOTP7HiiD9c4Ig/iYuVP17JTTxZFlu8DnApQN9vKUCzE5g/1neXP5QKlT8ejpo/nX8GvJF+BTxMYClAVmApQEQ3kz9KSoQ/wCeGP0DVlD++IpQ8bTmjvAz0KUDM8ylAjU+bP5dwnD8un5k/8uOdP+7TvTx8WPO8xIIqQGCCKkCqlKI/GpCmP12Koz9oD6U/7tTFO7nusbvvGSlA6hkpQLxPlT/R1Y8/OK2OPyTUlz+vyAG8rrv6O9luKUDtbilA/NeRP2jMgj9QbIQ/m9aTP1BbgLsh84g7tQwqQLUMKkDENZM/xiuHP2zKhz+BdJU/XWIevMrvHTxSFilAVhYpQPDskz+HrYM/BBqGP0dilT+roTW8nwc1PMDcKEDi3ChAHGOUP0W8gj/3s4U/3r+VPxapmDtSS4S7La8oQCmvKECkwZQ/ZFmOPwJ5jT8MQpc/0k0bO6G2ybpR0ilATNIpQGpXlT96yI0/hiuNPzbulz8AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHgOgDye5Iu8m8wpQGrMKUA8C5o/+sCaP68XmD/dmJw/Npt7O2RFW7yxbi5AHm4uQCeNsT/cDbg/3Qy2P9rPsj+DYJO7F3WXO0rtKUBl7SlAZ+uSP+eJhj+kTYc/DwKVPzzHCzt5cJ66BDkqQPQ4KkAc4pU/jBmOP5SJjT+BcZg/ef0kOhDoHbkiwilAHcIpQPrzkz9TQ4s/ddSKPzJ0lj+yN5W8TXCKPKnIJkDEyCZAd+CUPzUWez/T9oI//DKVPyEdpTtmTJK7sUIqQKpCKkCgcJY/zwSRP9PQjz+x+5g/ZYZPPBbyVrz/iClA04gpQH/8lz99DJc/+bGUP+V9mj/3vTy7DHpcO2RFKkBYRSpAot2TP8BSiD8XzIg/lieWP0QLk7tSepU7H94pQCfeKUCrnpI/mGmGP1gVhz8xvZQ/WNSKO9pSZ7sX5ClABeQpQC3DlT/KUI8/elqOPwdTmD8m+oY7cgtau2yVKUBalSlACJ6VP571jj/sHI4/GCuYP5xLcLpkO586IMkpQCXJKUAta5M/aumJP8iziT+CvJU/oOogu3ASNjslPSpARD0qQBTckz/B5Yg/jzeJP94Dlj8AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADBBT7yM3UQ8p2coQL9nKEB2JZM/WNyAP3sGhD8gW5Q/GzeQu3YaljuE+SlAhPkpQM9Dkz8X+4Y/9sWHP8JGlT/A/Qm8x8AIPMRXKUDSVylANPqSPy4fgz+oJ4U/GcqUP41sarvL/3074R4qQOYeKkA7cJM/BI+HP9QriD/EkJU/JelhOwimLrtVRSpAOkUqQLshlj9JVo8/JnqOPxWsmD/64Yk8TeuWvFd4KUAieClAlj2aP8UQmz94Y5g/ZcucP+vflzoCb6q58fkpQPr5KUBChJU/zGKNP1zzjD+nDJg/FSCSu66UlztV7ilAXe4pQC3Rkj8eooY/i0CHPxEWlT+IteY7TGXNuyRqKkAVaipAup2WPxJ0kT9fE5A/eTqZP/P9ELvCTiM7d9YpQILWKUDrTZM/ufOIP9/6iD+xn5U/L+zYO8bhy7v93ihA4t4oQDq3lD+IeY8/RiqOP0NElz/bCN27kXLjO/ixKUAWsilAXDCTPwhthD9gEYY/9RaVP6JzRLy+pjw8B5koQCOZKEBTMpM/1zmBPy4/hD/We5Q/GApUu7wzYjsvaClAOGgpQIaAkj/1mYc/PNeHP7nalD/2fr67SqTAO8/HKUD0xylA3DmTP8XJhT/o/IY/3CGVP8MzurtQZLk7YbApQHuwKUChN5I/gjeFPzwUhj+vhZQ/nTi3up6q6jrppClA+aQpQH6Zkj8654c/7P2HPygFlT8AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITt17smy9g7SaopQFCqKUCmxZI/YbyEPzIihj8vrZQ/mIVOvNwIRDwAeChAH3goQGIJkz8o04A/O/GDPwNIlD8bFoq7FWaRO0X4KUBX+ClAixKTP6oYhz8wrYc/T1WVP85kLTm0exg6EHEpQBNxKUBZGpQ/sWCLP3Aaiz+9qZY/Czj2uxBf7ztpaylAeWspQJ+Skj9uLoQ/pruFPxpWlD8f/EK7k19YO4YoKkCbKCpAGJqTPz9ZiD/WuIg/YtSVP9R2HDvK4uy6CPcpQPr2KUBgbJQ/nnWMP0DOiz/c/JY/p+mQPGFaobxsiilAPYopQH3qmj9KE5w/C0mZPxhynT9xXT27iaNUO445KkCJOSpAAbKTPxA1iD9bpIg/NfaVP7DklzzDiai8s8QpQHbEKUANSJs/m5ScPyy8mT+i2p0/b+wdPFS7FbyzLClAkCwpQN1NlT/0WZE/TauPP63flz+eQtI6t9Aoukr4KUAd+ClAIvCVP+UIjj8/nY0/5naYPx7fgTHzoH6xqA2KN/gVijf1OG0yHj6PMnCZhzJrifcxtyOcPGL1sLwOtSlAyLQpQAfRmz8uhZ0/M6OaP8Vanj+yJ22722t2O9bZKUDm2SlALv6SP+C7hz98D4g/8UOVP/8Rt7t9Drg7CcgpQCXIKUDD2pI/O9OFP0/chj8C2JQ/AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACky+67NKXsO2eHKUBuhylAiqeSP/4EhD8unoU/732UP0EGYrsNaIA7G0QqQCJEKkD0F5Q/kPuHP3G5iD+9NZY/EqeIvCFwgDwgYCdASGAnQPWDlD+YDX0/mlCDP94mlT9Vdf+7BUr/OwKBKUAhgSlALfmSP1zSgz+Ko4U/rsKUPz9EsLsN4LA71M4pQOHOKUDK35I/KMOFP5PJhj9J4pQ/7qTiu0SA4jt9lSlAmJUpQGojkz+1RIU/ErmGP7fhlD8c5iW8icUiPIUcKUCaHClAX1WTP1C7gj+SNIU/QdaUPw=="}}}}, {"name": "dmodel_seq/conv2d_1/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}, "tensorContent": "ZQdtuztj8rwJCCpA1AcqQJwsoz8IMZU/sUSWPxU7pT8="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "intVal": [1]}}}}, {"name": "strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Greater_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "11"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "4"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "11"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"N": {"i": "1"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/l2_normalize/Square", "op": "Square", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/l2_normalize/Sum", "op": "Sum", "input": ["PartitionedCall/l2_normalize/Square", "PartitionedCall/l2_normalize/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/l2_normalize/Maximum", "op": "Maximum", "input": ["PartitionedCall/l2_normalize/Sum", "PartitionedCall/l2_normalize/Maximum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/l2_normalize/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/l2_normalize/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/l2_normalize", "op": "Mul", "input": ["PartitionedCall/depthwise", "PartitionedCall/l2_normalize/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/l2_normalize"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dmodel_seq/conv2d/Conv2D/ReadVariableOp", "op": "Identity", "input": ["dmodel_seq/conv2d/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "dmodel_seq/conv2d/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "dmodel_seq/conv2d/Conv2D/ReadVariableOp"], "attr": {"padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dmodel_seq/conv2d/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["dmodel_seq/conv2d/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "dmodel_seq/conv2d/BiasAdd", "op": "BiasAdd", "input": ["dmodel_seq/conv2d/Conv2D", "dmodel_seq/conv2d/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "dmodel_seq/conv2d/Relu", "op": "Relu", "input": ["dmodel_seq/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dmodel_seq/conv2d_1/Conv2D/ReadVariableOp", "op": "Identity", "input": ["dmodel_seq/conv2d_1/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "dmodel_seq/conv2d_1/Conv2D", "op": "Conv2D", "input": ["dmodel_seq/conv2d/Relu", "dmodel_seq/conv2d_1/Conv2D/ReadVariableOp"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "dmodel_seq/conv2d_1/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["dmodel_seq/conv2d_1/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "dmodel_seq/conv2d_1/BiasAdd", "op": "BiasAdd", "input": ["dmodel_seq/conv2d_1/Conv2D", "dmodel_seq/conv2d_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["dmodel_seq/conv2d_1/BiasAdd", "step_size"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["x", "strided_slice_1/stack", "strided_slice_1/stack_1", "strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "begin_mask": {"i": "15"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "Shape", "op": "Shape", "input": ["strided_slice_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "random_uniform/RandomUniform", "op": "RandomUniform", "input": ["Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "LessEqual", "op": "LessEqual", "input": ["random_uniform/RandomUniform", "fire_rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Cast", "op": "Cast", "input": ["LessEqual"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_BOOL"}}}, {"name": "mul_1", "op": "Mul", "input": ["mul", "Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["x", "mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["add", "strided_slice_2/stack", "strided_slice_2/stack_1", "strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool2d_1", "op": "MaxPool", "input": ["strided_slice_2"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater_1", "op": "Greater", "input": ["MaxPool2d_1", "Greater_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "and", "op": "LogicalAnd", "input": ["Greater", "Greater_1"]}, {"name": "Cast_1", "op": "Cast", "input": ["and"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}}}, {"name": "mul_2", "op": "Mul", "input": ["add", "Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "NoOp", "op": "NoOp", "input": ["^dmodel_seq/conv2d/BiasAdd/ReadVariableOp", "^dmodel_seq/conv2d/Conv2D/ReadVariableOp", "^dmodel_seq/conv2d_1/BiasAdd/ReadVariableOp", "^dmodel_seq/conv2d_1/Conv2D/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["mul_2", "^NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": "1.14", "minConsumer": "1.14"}}, "weightsManifest": []}